package examples.java.chapter2;

// extends : í™•ìž¥í•œë‹¤ (ë¬´ì¡°ê±´ í?´ëž˜ìŠ¤ í•˜ë‚˜ë§Œ)
// implements: êµ¬í˜„í•œë‹¤ (ì?¸í„°íŽ˜ì?´ìŠ¤ ì—¬ëŸ¬ê°œë?„)
// multiple inheritance (ë‹¤ì¤‘ ìƒ?ì†?): Super í?´ëž˜ìŠ¤ê°€ ì—¬ëŸ¬ê°œ

// ë‹¤ì¤‘ìƒ?ì†?ì?„ ë°›ì?„ë•ŒëŠ” ì?¸í„°íŽ˜ì?´ìŠ¤ë§Œ ê°€ëŠ¥í•˜ë‹¤
// ì?¸í„°íŽ˜ì?´ìŠ¤ë§Œ ë‹¤ì¤‘ìƒ?ì†?ì?´ ê°€ëŠ¥í•œ ì?´ìœ 
// ì?¸í„°íŽ˜ì?´ìŠ¤ëŠ” ë©¤ë²„ë¡œ public abstract method ë§Œ ê°€ì§ˆ ìˆ˜ ìžˆì?Œ. (ì¦‰, field ê°€ ë‚˜ì˜¬ ìˆ˜ ì—†ì?Œ)
// ë”°ë?¼ì„œ, ë‹¤ì¤‘ìƒ?ì†?ì?„ ë°›ì?„ ë•Œ ìƒ?ì†?ë°›ëŠ” ë‘? Super class ì?˜ member field ì?´ë¦„ì?´ ê²¹ì³?ì„œ ì¶©ë?Œì?´ ë°œìƒ?í•˜ëŠ” ê²½ìš°
// (ì˜ˆë¥¼ë“¤ì–´ C ê°€ A ì™€ B ë¥¼ ë?™ì‹œì—? ìƒ?ì†?ë°›ëŠ”ë‹¤ ê°€ì •í•  ë•Œ, A ì™€ B ë‘˜ë‹¤ member field ë¡œ d ë?¼ëŠ” ë©¤ë²„ë¥¼ ê°€ì§€ê³  ìžˆì?„ ê²½ìš°, C ì—?ì„œëŠ” A ì?˜ d ì™€ B ì?˜ dë¥¼ ë‘˜ë‹¤ ë¬¼ë ¤ë°›ê¸° ë•Œë¬¸ì—?
//  d ë¥¼ ì‚¬ìš©í•˜ê²Œë?˜ë©´ ëˆ„êµ¬ë¡œë¶€í„° ë¬¼ë ¤ë°›ì?€ d ë¥¼ ê°€ë¦¬í‚¤ê²Œ ë?˜ëŠ”ì§€ ëª¨í˜¸í•¨ì?´ ë°œìƒ?í•˜ê²Œ ë?¨.)
// ë˜?í•œ, abstract method ê°€ ì•„ë‹Œ ì?¼ë°˜ method ë¥¼ ë¬¼ë ¤ë°›ëŠ” ê²½ìš°ì—?ë?„ ë§ˆì°¬ê°€ì§€ë¡œ A ì™€ B ë‘˜ë‹¤ member method ë¡œ abstract ê°€ ì•„ë‹Œ f ë?¼ëŠ” method ê°€ ìžˆì?„ ê²½ìš°,
// C ì—?ì„œëŠ” ë‘? A ì™€ B ì?˜ f ë¥¼ ë‹¤ ë¬¼ë ¤ë°›ê¸° ë•Œë¬¸ì—? C ë¥¼ í†µí•´ì„œ f ë¥¼ í˜¸ì¶œí•˜ê²Œë?˜ë©´ ë¬¼ë ¤ë°›ì?€ f ëŠ” ëˆ„êµ¬ì?˜ f ì?¸ì§€ íŒ?ë³„í•˜ê¸°ê°€ ëª¨í˜¸í•´ì§?.
// ì?´ë¥¼ í•´ê²°í•˜ê¸° ìœ„í•´ interface ê°€ ë“±ìž¥.

// ì?¸í„°íŽ˜ì?´ìŠ¤ëŠ” ë©¤ë²„ í•„ë“œë¥¼ ê°€ì§Œ ìˆ˜ ì—†ê³  ë¬´ì¡°ê±´ abstract method ë§Œ ê°€ì§ˆ ìˆ˜ ìžˆê¸°ì—? C ë?¼ëŠ” í?´ëž˜ìŠ¤ì—?ì„œ A ì™€ B ë?¼ëŠ” ì?¸í„°íŽ˜ì?´ìŠ¤ë¡œë¶€í„° ê°?ê°? ë¬¼ë ¤ë°›ì?€ method ë“¤ì?˜ ì?´ë¦„ì?´ ê²¹ì¹˜ë?”ë?¼ë?„
// ì‹¤ì œ êµ¬í˜„ (method ì?˜ body) ëŠ” í•˜ë‚˜ë§Œ ì¡´ìž¬í•˜ê¸° ë•Œë¬¸ì—? ëª¨í˜¸í•¨ì?´ ë°œìƒ?í•˜ì§€ ì•Šì?Œ.
// ë”°ë?¼ì„œ, Java ì—?ì„œëŠ” multiple inheritance ë¥¼ interface ë¥¼ í†µí•œ ê²½ìš°ë§Œ í—ˆìš©í•¨.
public abstract class Weapon extends GameItem implements Equippable, Droppable {
	private String itemName;
	
	// Weapon ìž?ì²´ì?˜ abstract method
	public abstract int getAttackDamage();

	@Override
	// Equippable ì?¸í„°íŽ˜ì?´ìŠ¤ë¡œë¶€í„° ë¬¼ë ¤ë°›ì?€ method
	public String getItemName() {
		return itemName;
	}
	
	@Override
	// Droppable ì?¸í„°íŽ˜ì?´ìŠ¤ë¡œë¶€í„° ë¬¼ë ¤ë°›ì?€ method
	public int getDropPosition() {
		return 0;
	}
}